<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"04e6771f8e1ae5b86321cca7780a292b3200a87e0271f51c48c0ad5bbe3672af","plan_job_ref":"Job .github/workflows/_test-tf.yaml #196 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361144661","plan_out_hash":"514f0d5e500c69bb03603305831ed3e8b420dc0cce066978a38f1e3a398565e4","plan_hash":"3b1cf8c9399380879e0d6d967ac763ce45394a6ccd6f27e7a1e85473d91ba531","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #196](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361144661)